```
------------------------------------------------------------------------
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
Terraform will perform the following actions:
  # module.catalog.aws_security_group.fgdc2iso will be created
  + resource "aws_security_group" "fgdc2iso" {
      + arn                    = (known after apply)
      + description            = "Security group for catalog-fgdc2iso instance in sandbox"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0aea4baa7e28509e9",
                ]
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0aea4baa7e28509e9",
                ]
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "catalog-fgdc2iso-sandbox"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "env" = "sandbox"
        }
      + vpc_id                 = "vpc-0e4d22d8b2666bf6f"
    }
  # module.catalog.aws_security_group.harvester will be updated in-place
  ~ resource "aws_security_group" "harvester" {
        arn                    = "arn:aws:ec2:us-east-1:587807691409:security-group/sg-0aea4baa7e28509e9"
        description            = "Catalog harvester security group"
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = null
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = null
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/8",
                ]
              + description      = ""
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
        id                     = "sg-0aea4baa7e28509e9"
        ingress                = []
        name                   = "sandbox-catalog-harvester-tf"
        owner_id               = "587807691409"
        revoke_rules_on_delete = false
        tags                   = {
            "env" = "sandbox"
        }
        vpc_id                 = "vpc-0e4d22d8b2666bf6f"
    }
  # module.catalog.aws_security_group.web will be updated in-place
  ~ resource "aws_security_group" "web" {
        arn                    = "arn:aws:ec2:us-east-1:587807691409:security-group/sg-0fe651dbcb6701f41"
        description            = "Security group for catalog web instance in sandbox"
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/8",
                ]
              + description      = ""
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
        id                     = "sg-0fe651dbcb6701f41"
        ingress                = []
        name                   = "catalog-sandbox"
        owner_id               = "587807691409"
        revoke_rules_on_delete = false
        tags                   = {
            "env"  = "sandbox"
            "name" = "catalog"
        }
        vpc_id                 = "vpc-0e4d22d8b2666bf6f"
    }
  # module.catalog.module.fgdc2iso.aws_instance.default[0] will be created
  + resource "aws_instance" "default" {
      + ami                          = "ami-0ac80df6eff0e70b5"
      + arn                          = (known after apply)
      + associate_public_ip_address  = false
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t2.micro"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = "datagov-sandbox"
      + network_interface_id         = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = "subnet-0bbe8705ad1ce9a08"
      + tags                         = {
          + "Name"  = "catalog-fgdc2iso1tf"
          + "env"   = "sandbox"
          + "group" = "catalog_fgdc2iso"
        }
      + tenancy                      = (known after apply)
      + volume_tags                  = (known after apply)
      + vpc_security_group_ids       = (known after apply)
      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }
      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }
      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }
      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }
  # module.catalog.module.fgdc2iso.aws_route53_record.default[0] will be created
  + resource "aws_route53_record" "default" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "catalog-fgdc2iso1tf"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z1006361VZ0GA3BRODCA"
    }
  # module.catalog.module.web.aws_instance.web[0] will be updated in-place
  ~ resource "aws_instance" "web" {
        ami                          = "ami-000b3a073fc20e415"
        arn                          = "arn:aws:ec2:us-east-1:587807691409:instance/i-04ae9330f89857726"
        associate_public_ip_address  = false
        availability_zone            = "us-east-1a"
        cpu_core_count               = 1
        cpu_threads_per_core         = 2
        disable_api_termination      = false
        ebs_optimized                = false
        get_password_data            = false
        hibernation                  = false
        id                           = "i-04ae9330f89857726"
        instance_state               = "running"
        instance_type                = "t3.medium"
        ipv6_address_count           = 0
        ipv6_addresses               = []
        key_name                     = "datagov-sandbox"
        monitoring                   = false
        primary_network_interface_id = "eni-0fac1a7fd015d31e5"
        private_dns                  = "ip-10-0-1-82.ec2.internal"
        private_ip                   = "10.0.1.82"
        security_groups              = []
        source_dest_check            = true
        subnet_id                    = "subnet-0bbe8705ad1ce9a08"
        tags                         = {
            "Name"  = "catalog-web1tf"
            "env"   = "sandbox"
            "group" = "catalog_web,catalog_web_v1,pycsw_web,v1"
        }
        tenancy                      = "default"
        volume_tags                  = {}
      ~ vpc_security_group_ids       = [
            "sg-03ac86fa45813a8de",
            "sg-0599014293c0c3234",
            "sg-0cb28298e90b22f14",
            "sg-0e73950e4dbbc9704",
          + "sg-0fe651dbcb6701f41",
        ]
        credit_specification {
            cpu_credits = "unlimited"
        }
        metadata_options {
            http_endpoint               = "enabled"
            http_put_response_hop_limit = 1
            http_tokens                 = "optional"
        }
        root_block_device {
            delete_on_termination = true
            device_name           = "/dev/sda1"
            encrypted             = false
            iops                  = 100
            volume_id             = "vol-07b17b1a089b3c3f1"
            volume_size           = 8
            volume_type           = "gp2"
        }
    }
Plan: 3 to add, 3 to change, 0 to destroy.
------------------------------------------------------------------------
 
```